GopalSaraf/Practicals/PSDL/include/proc/pic18c658.h
// Register: RXF1EIDL
#define RXF1EIDL RXF1EIDL
extern volatile unsigned char           RXF1EIDL            __at(0xF07);
#ifndef _LIB_BUILD
asm("RXF1EIDL equ 0F07h");
#endif
// aliases
extern volatile unsigned char           RXF1EID0            __at(0xF07);
#ifndef _LIB_BUILD
asm("RXF1EID0 equ 0F07h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF1EID0               :1;
        unsigned RXF1EID1               :1;
        unsigned RXF1EID2               :1;
        unsigned RXF1EID3               :1;
        unsigned RXF1EID4               :1;
        unsigned RXF1EID5               :1;
        unsigned RXF1EID6               :1;
        unsigned RXF1EID7               :1;
    };
} RXF1EIDLbits_t;
extern volatile RXF1EIDLbits_t RXF1EIDLbits __at(0xF07);
// bitfield macros
#define _RXF1EIDL_EID0_POSN                                 0x0
#define _RXF1EIDL_EID0_POSITION                             0x0
#define _RXF1EIDL_EID0_SIZE                                 0x1
#define _RXF1EIDL_EID0_LENGTH                               0x1
#define _RXF1EIDL_EID0_MASK                                 0x1
#define _RXF1EIDL_EID1_POSN                                 0x1
#define _RXF1EIDL_EID1_POSITION                             0x1
#define _RXF1EIDL_EID1_SIZE                                 0x1
#define _RXF1EIDL_EID1_LENGTH                               0x1
#define _RXF1EIDL_EID1_MASK                                 0x2
#define _RXF1EIDL_EID2_POSN                                 0x2
#define _RXF1EIDL_EID2_POSITION                             0x2
#define _RXF1EIDL_EID2_SIZE                                 0x1
#define _RXF1EIDL_EID2_LENGTH                               0x1
#define _RXF1EIDL_EID2_MASK                                 0x4
#define _RXF1EIDL_EID3_POSN                                 0x3
#define _RXF1EIDL_EID3_POSITION                             0x3
#define _RXF1EIDL_EID3_SIZE                                 0x1
#define _RXF1EIDL_EID3_LENGTH                               0x1
#define _RXF1EIDL_EID3_MASK                                 0x8
#define _RXF1EIDL_EID4_POSN                                 0x4
#define _RXF1EIDL_EID4_POSITION                             0x4
#define _RXF1EIDL_EID4_SIZE                                 0x1
#define _RXF1EIDL_EID4_LENGTH                               0x1
#define _RXF1EIDL_EID4_MASK                                 0x10
#define _RXF1EIDL_EID5_POSN                                 0x5
#define _RXF1EIDL_EID5_POSITION                             0x5
#define _RXF1EIDL_EID5_SIZE                                 0x1
#define _RXF1EIDL_EID5_LENGTH                               0x1
#define _RXF1EIDL_EID5_MASK                                 0x20
#define _RXF1EIDL_EID6_POSN                                 0x6
#define _RXF1EIDL_EID6_POSITION                             0x6
#define _RXF1EIDL_EID6_SIZE                                 0x1
#define _RXF1EIDL_EID6_LENGTH                               0x1
#define _RXF1EIDL_EID6_MASK                                 0x40
#define _RXF1EIDL_EID7_POSN                                 0x7
#define _RXF1EIDL_EID7_POSITION                             0x7
#define _RXF1EIDL_EID7_SIZE                                 0x1
#define _RXF1EIDL_EID7_LENGTH                               0x1
#define _RXF1EIDL_EID7_MASK                                 0x80
#define _RXF1EIDL_RXF1EID0_POSN                             0x0
#define _RXF1EIDL_RXF1EID0_POSITION                         0x0
#define _RXF1EIDL_RXF1EID0_SIZE                             0x1
#define _RXF1EIDL_RXF1EID0_LENGTH                           0x1
#define _RXF1EIDL_RXF1EID0_MASK                             0x1
#define _RXF1EIDL_RXF1EID1_POSN                             0x1
#define _RXF1EIDL_RXF1EID1_POSITION                         0x1
#define _RXF1EIDL_RXF1EID1_SIZE                             0x1
#define _RXF1EIDL_RXF1EID1_LENGTH                           0x1
#define _RXF1EIDL_RXF1EID1_MASK                             0x2
#define _RXF1EIDL_RXF1EID2_POSN                             0x2
#define _RXF1EIDL_RXF1EID2_POSITION                         0x2
#define _RXF1EIDL_RXF1EID2_SIZE                             0x1
#define _RXF1EIDL_RXF1EID2_LENGTH                           0x1
#define _RXF1EIDL_RXF1EID2_MASK                             0x4
#define _RXF1EIDL_RXF1EID3_POSN                             0x3
#define _RXF1EIDL_RXF1EID3_POSITION                         0x3
#define _RXF1EIDL_RXF1EID3_SIZE                             0x1
#define _RXF1EIDL_RXF1EID3_LENGTH                           0x1
#define _RXF1EIDL_RXF1EID3_MASK                             0x8
#define _RXF1EIDL_RXF1EID4_POSN                             0x4
#define _RXF1EIDL_RXF1EID4_POSITION                         0x4
#define _RXF1EIDL_RXF1EID4_SIZE                             0x1
#define _RXF1EIDL_RXF1EID4_LENGTH                           0x1
#define _RXF1EIDL_RXF1EID4_MASK                             0x10
#define _RXF1EIDL_RXF1EID5_POSN                             0x5
#define _RXF1EIDL_RXF1EID5_POSITION                         0x5
#define _RXF1EIDL_RXF1EID5_SIZE                             0x1
#define _RXF1EIDL_RXF1EID5_LENGTH                           0x1
#define _RXF1EIDL_RXF1EID5_MASK                             0x20
#define _RXF1EIDL_RXF1EID6_POSN                             0x6
#define _RXF1EIDL_RXF1EID6_POSITION                         0x6
#define _RXF1EIDL_RXF1EID6_SIZE                             0x1
#define _RXF1EIDL_RXF1EID6_LENGTH                           0x1
#define _RXF1EIDL_RXF1EID6_MASK                             0x40
#define _RXF1EIDL_RXF1EID7_POSN                             0x7
#define _RXF1EIDL_RXF1EID7_POSITION                         0x7
#define _RXF1EIDL_RXF1EID7_SIZE                             0x1
#define _RXF1EIDL_RXF1EID7_LENGTH                           0x1
#define _RXF1EIDL_RXF1EID7_MASK                             0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF1EID0               :1;
        unsigned RXF1EID1               :1;
        unsigned RXF1EID2               :1;
        unsigned RXF1EID3               :1;
        unsigned RXF1EID4               :1;
        unsigned RXF1EID5               :1;
        unsigned RXF1EID6               :1;
        unsigned RXF1EID7               :1;
    };
} RXF1EID0bits_t;
