GopalSaraf/Practicals/PSDL/include/proc/pic18c658.h
extern volatile RXM0EID0bits_t RXM0EID0bits __at(0xF1B);
// bitfield macros
#define _RXM0EID0_EID0_POSN                                 0x0
#define _RXM0EID0_EID0_POSITION                             0x0
#define _RXM0EID0_EID0_SIZE                                 0x1
#define _RXM0EID0_EID0_LENGTH                               0x1
#define _RXM0EID0_EID0_MASK                                 0x1
#define _RXM0EID0_EID1_POSN                                 0x1
#define _RXM0EID0_EID1_POSITION                             0x1
#define _RXM0EID0_EID1_SIZE                                 0x1
#define _RXM0EID0_EID1_LENGTH                               0x1
#define _RXM0EID0_EID1_MASK                                 0x2
#define _RXM0EID0_EID2_POSN                                 0x2
#define _RXM0EID0_EID2_POSITION                             0x2
#define _RXM0EID0_EID2_SIZE                                 0x1
#define _RXM0EID0_EID2_LENGTH                               0x1
#define _RXM0EID0_EID2_MASK                                 0x4
#define _RXM0EID0_EID3_POSN                                 0x3
#define _RXM0EID0_EID3_POSITION                             0x3
#define _RXM0EID0_EID3_SIZE                                 0x1
#define _RXM0EID0_EID3_LENGTH                               0x1
#define _RXM0EID0_EID3_MASK                                 0x8
#define _RXM0EID0_EID4_POSN                                 0x4
#define _RXM0EID0_EID4_POSITION                             0x4
#define _RXM0EID0_EID4_SIZE                                 0x1
#define _RXM0EID0_EID4_LENGTH                               0x1
#define _RXM0EID0_EID4_MASK                                 0x10
#define _RXM0EID0_EID5_POSN                                 0x5
#define _RXM0EID0_EID5_POSITION                             0x5
#define _RXM0EID0_EID5_SIZE                                 0x1
#define _RXM0EID0_EID5_LENGTH                               0x1
#define _RXM0EID0_EID5_MASK                                 0x20
#define _RXM0EID0_EID6_POSN                                 0x6
#define _RXM0EID0_EID6_POSITION                             0x6
#define _RXM0EID0_EID6_SIZE                                 0x1
#define _RXM0EID0_EID6_LENGTH                               0x1
#define _RXM0EID0_EID6_MASK                                 0x40
#define _RXM0EID0_EID7_POSN                                 0x7
#define _RXM0EID0_EID7_POSITION                             0x7
#define _RXM0EID0_EID7_SIZE                                 0x1
#define _RXM0EID0_EID7_LENGTH                               0x1
#define _RXM0EID0_EID7_MASK                                 0x80
#define _RXM0EID0_RXM0EID0_POSN                             0x0
#define _RXM0EID0_RXM0EID0_POSITION                         0x0
#define _RXM0EID0_RXM0EID0_SIZE                             0x1
#define _RXM0EID0_RXM0EID0_LENGTH                           0x1
#define _RXM0EID0_RXM0EID0_MASK                             0x1
#define _RXM0EID0_RXM0EID1_POSN                             0x1
#define _RXM0EID0_RXM0EID1_POSITION                         0x1
#define _RXM0EID0_RXM0EID1_SIZE                             0x1
#define _RXM0EID0_RXM0EID1_LENGTH                           0x1
#define _RXM0EID0_RXM0EID1_MASK                             0x2
#define _RXM0EID0_RXM0EID2_POSN                             0x2
#define _RXM0EID0_RXM0EID2_POSITION                         0x2
#define _RXM0EID0_RXM0EID2_SIZE                             0x1
#define _RXM0EID0_RXM0EID2_LENGTH                           0x1
#define _RXM0EID0_RXM0EID2_MASK                             0x4
#define _RXM0EID0_RXM0EID3_POSN                             0x3
#define _RXM0EID0_RXM0EID3_POSITION                         0x3
#define _RXM0EID0_RXM0EID3_SIZE                             0x1
#define _RXM0EID0_RXM0EID3_LENGTH                           0x1
#define _RXM0EID0_RXM0EID3_MASK                             0x8
#define _RXM0EID0_RXM0EID4_POSN                             0x4
#define _RXM0EID0_RXM0EID4_POSITION                         0x4
#define _RXM0EID0_RXM0EID4_SIZE                             0x1
#define _RXM0EID0_RXM0EID4_LENGTH                           0x1
#define _RXM0EID0_RXM0EID4_MASK                             0x10
#define _RXM0EID0_RXM0EID5_POSN                             0x5
#define _RXM0EID0_RXM0EID5_POSITION                         0x5
#define _RXM0EID0_RXM0EID5_SIZE                             0x1
#define _RXM0EID0_RXM0EID5_LENGTH                           0x1
#define _RXM0EID0_RXM0EID5_MASK                             0x20
#define _RXM0EID0_RXM0EID6_POSN                             0x6
#define _RXM0EID0_RXM0EID6_POSITION                         0x6
#define _RXM0EID0_RXM0EID6_SIZE                             0x1
#define _RXM0EID0_RXM0EID6_LENGTH                           0x1
#define _RXM0EID0_RXM0EID6_MASK                             0x40
#define _RXM0EID0_RXM0EID7_POSN                             0x7
#define _RXM0EID0_RXM0EID7_POSITION                         0x7
#define _RXM0EID0_RXM0EID7_SIZE                             0x1
#define _RXM0EID0_RXM0EID7_LENGTH                           0x1
#define _RXM0EID0_RXM0EID7_MASK                             0x80

// Register: RXM1SIDH
#define RXM1SIDH RXM1SIDH
extern volatile unsigned char           RXM1SIDH            __at(0xF1C);
#ifndef _LIB_BUILD
asm("RXM1SIDH equ 0F1Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXM1SID3               :1;
        unsigned RXM1SID4               :1;
        unsigned RXM1SID5               :1;
        unsigned RXM1SID6               :1;
        unsigned RXM1SID7               :1;
        unsigned RXM1SID8               :1;
        unsigned RXM1SID9               :1;
        unsigned RXM1SID10              :1;
    };
} RXM1SIDHbits_t;
extern volatile RXM1SIDHbits_t RXM1SIDHbits __at(0xF1C);
// bitfield macros
#define _RXM1SIDH_SID3_POSN                                 0x0
#define _RXM1SIDH_SID3_POSITION                             0x0
#define _RXM1SIDH_SID3_SIZE                                 0x1
#define _RXM1SIDH_SID3_LENGTH                               0x1
#define _RXM1SIDH_SID3_MASK                                 0x1
#define _RXM1SIDH_SID4_POSN                                 0x1
#define _RXM1SIDH_SID4_POSITION                             0x1
#define _RXM1SIDH_SID4_SIZE                                 0x1
#define _RXM1SIDH_SID4_LENGTH                               0x1
#define _RXM1SIDH_SID4_MASK                                 0x2
#define _RXM1SIDH_SID5_POSN                                 0x2
#define _RXM1SIDH_SID5_POSITION                             0x2
#define _RXM1SIDH_SID5_SIZE                                 0x1
#define _RXM1SIDH_SID5_LENGTH                               0x1
#define _RXM1SIDH_SID5_MASK                                 0x4
#define _RXM1SIDH_SID6_POSN                                 0x3
#define _RXM1SIDH_SID6_POSITION                             0x3
#define _RXM1SIDH_SID6_SIZE                                 0x1
#define _RXM1SIDH_SID6_LENGTH                               0x1
#define _RXM1SIDH_SID6_MASK                                 0x8
#define _RXM1SIDH_SID7_POSN                                 0x4
#define _RXM1SIDH_SID7_POSITION                             0x4
#define _RXM1SIDH_SID7_SIZE                                 0x1
#define _RXM1SIDH_SID7_LENGTH                               0x1
#define _RXM1SIDH_SID7_MASK                                 0x10
#define _RXM1SIDH_SID8_POSN                                 0x5
#define _RXM1SIDH_SID8_POSITION                             0x5
#define _RXM1SIDH_SID8_SIZE                                 0x1
#define _RXM1SIDH_SID8_LENGTH                               0x1
#define _RXM1SIDH_SID8_MASK                                 0x20
#define _RXM1SIDH_SID9_POSN                                 0x6
#define _RXM1SIDH_SID9_POSITION                             0x6
#define _RXM1SIDH_SID9_SIZE                                 0x1
#define _RXM1SIDH_SID9_LENGTH                               0x1
#define _RXM1SIDH_SID9_MASK                                 0x40
#define _RXM1SIDH_SID10_POSN                                0x7
#define _RXM1SIDH_SID10_POSITION                            0x7
#define _RXM1SIDH_SID10_SIZE                                0x1
#define _RXM1SIDH_SID10_LENGTH                              0x1
#define _RXM1SIDH_SID10_MASK                                0x80
#define _RXM1SIDH_RXM1SID3_POSN                             0x0
#define _RXM1SIDH_RXM1SID3_POSITION                         0x0
#define _RXM1SIDH_RXM1SID3_SIZE                             0x1
#define _RXM1SIDH_RXM1SID3_LENGTH                           0x1
#define _RXM1SIDH_RXM1SID3_MASK                             0x1
#define _RXM1SIDH_RXM1SID4_POSN                             0x1
#define _RXM1SIDH_RXM1SID4_POSITION                         0x1
#define _RXM1SIDH_RXM1SID4_SIZE                             0x1
#define _RXM1SIDH_RXM1SID4_LENGTH                           0x1
#define _RXM1SIDH_RXM1SID4_MASK                             0x2
#define _RXM1SIDH_RXM1SID5_POSN                             0x2
#define _RXM1SIDH_RXM1SID5_POSITION                         0x2
#define _RXM1SIDH_RXM1SID5_SIZE                             0x1
#define _RXM1SIDH_RXM1SID5_LENGTH                           0x1
#define _RXM1SIDH_RXM1SID5_MASK                             0x4
#define _RXM1SIDH_RXM1SID6_POSN                             0x3
#define _RXM1SIDH_RXM1SID6_POSITION                         0x3
#define _RXM1SIDH_RXM1SID6_SIZE                             0x1
#define _RXM1SIDH_RXM1SID6_LENGTH                           0x1
#define _RXM1SIDH_RXM1SID6_MASK                             0x8
#define _RXM1SIDH_RXM1SID7_POSN                             0x4
#define _RXM1SIDH_RXM1SID7_POSITION                         0x4
#define _RXM1SIDH_RXM1SID7_SIZE                             0x1
#define _RXM1SIDH_RXM1SID7_LENGTH                           0x1
#define _RXM1SIDH_RXM1SID7_MASK                             0x10
#define _RXM1SIDH_RXM1SID8_POSN                             0x5
#define _RXM1SIDH_RXM1SID8_POSITION                         0x5
#define _RXM1SIDH_RXM1SID8_SIZE                             0x1
#define _RXM1SIDH_RXM1SID8_LENGTH                           0x1
#define _RXM1SIDH_RXM1SID8_MASK                             0x20
#define _RXM1SIDH_RXM1SID9_POSN                             0x6
#define _RXM1SIDH_RXM1SID9_POSITION                         0x6
#define _RXM1SIDH_RXM1SID9_SIZE                             0x1
#define _RXM1SIDH_RXM1SID9_LENGTH                           0x1
#define _RXM1SIDH_RXM1SID9_MASK                             0x40
#define _RXM1SIDH_RXM1SID10_POSN                            0x7
#define _RXM1SIDH_RXM1SID10_POSITION                        0x7
#define _RXM1SIDH_RXM1SID10_SIZE                            0x1
#define _RXM1SIDH_RXM1SID10_LENGTH                          0x1
#define _RXM1SIDH_RXM1SID10_MASK                            0x80

// Register: RXM1SIDL
#define RXM1SIDL RXM1SIDL
extern volatile unsigned char           RXM1SIDL            __at(0xF1D);
#ifndef _LIB_BUILD
asm("RXM1SIDL equ 0F1Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :3;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned RXM1EID16              :1;
        unsigned RXM1EID17              :1;
        unsigned                        :3;
        unsigned RXM1SID0               :1;
        unsigned RXM1SID1               :1;
        unsigned RXM1SID2               :1;
    };
} RXM1SIDLbits_t;
extern volatile RXM1SIDLbits_t RXM1SIDLbits __at(0xF1D);
// bitfield macros
#define _RXM1SIDL_EID16_POSN                                0x0
#define _RXM1SIDL_EID16_POSITION                            0x0
#define _RXM1SIDL_EID16_SIZE                                0x1
#define _RXM1SIDL_EID16_LENGTH                              0x1
#define _RXM1SIDL_EID16_MASK                                0x1
#define _RXM1SIDL_EID17_POSN                                0x1
#define _RXM1SIDL_EID17_POSITION                            0x1
#define _RXM1SIDL_EID17_SIZE                                0x1
#define _RXM1SIDL_EID17_LENGTH                              0x1
#define _RXM1SIDL_EID17_MASK                                0x2
#define _RXM1SIDL_SID0_POSN                                 0x5
#define _RXM1SIDL_SID0_POSITION                             0x5
#define _RXM1SIDL_SID0_SIZE                                 0x1
#define _RXM1SIDL_SID0_LENGTH                               0x1
#define _RXM1SIDL_SID0_MASK                                 0x20
#define _RXM1SIDL_SID1_POSN                                 0x6
#define _RXM1SIDL_SID1_POSITION                             0x6
#define _RXM1SIDL_SID1_SIZE                                 0x1
#define _RXM1SIDL_SID1_LENGTH                               0x1
#define _RXM1SIDL_SID1_MASK                                 0x40
#define _RXM1SIDL_SID2_POSN                                 0x7
#define _RXM1SIDL_SID2_POSITION                             0x7
#define _RXM1SIDL_SID2_SIZE                                 0x1
#define _RXM1SIDL_SID2_LENGTH                               0x1
#define _RXM1SIDL_SID2_MASK                                 0x80
#define _RXM1SIDL_RXM1EID16_POSN                            0x0
#define _RXM1SIDL_RXM1EID16_POSITION                        0x0
#define _RXM1SIDL_RXM1EID16_SIZE                            0x1
#define _RXM1SIDL_RXM1EID16_LENGTH                          0x1
#define _RXM1SIDL_RXM1EID16_MASK                            0x1
#define _RXM1SIDL_RXM1EID17_POSN                            0x1
#define _RXM1SIDL_RXM1EID17_POSITION                        0x1
#define _RXM1SIDL_RXM1EID17_SIZE                            0x1
#define _RXM1SIDL_RXM1EID17_LENGTH                          0x1
#define _RXM1SIDL_RXM1EID17_MASK                            0x2
#define _RXM1SIDL_RXM1SID0_POSN                             0x5
#define _RXM1SIDL_RXM1SID0_POSITION                         0x5
#define _RXM1SIDL_RXM1SID0_SIZE                             0x1
#define _RXM1SIDL_RXM1SID0_LENGTH                           0x1
#define _RXM1SIDL_RXM1SID0_MASK                             0x20
#define _RXM1SIDL_RXM1SID1_POSN                             0x6
#define _RXM1SIDL_RXM1SID1_POSITION                         0x6
#define _RXM1SIDL_RXM1SID1_SIZE                             0x1
#define _RXM1SIDL_RXM1SID1_LENGTH                           0x1
#define _RXM1SIDL_RXM1SID1_MASK                             0x40
#define _RXM1SIDL_RXM1SID2_POSN                             0x7
#define _RXM1SIDL_RXM1SID2_POSITION                         0x7
#define _RXM1SIDL_RXM1SID2_SIZE                             0x1
#define _RXM1SIDL_RXM1SID2_LENGTH                           0x1
#define _RXM1SIDL_RXM1SID2_MASK                             0x80

